from flask import Flask, request, jsonify
import mysql_helper
from persiantools import digits
from datetime import datetime

from flask import json
app = Flask(__name__)

query_template={'advertisement_type':[], 'advertiser_type':[], 'category':[], 'size':'0-0', 'exchange':0, 'urgent':0,
       'rooms':[],'elevator':0,'floor':[],'agreed':0,'year':'0-0','parking':0,'region':[],'price':'0-0','rent':'0-0','deposite':'0-0'}

@app.route('/get_categories/', methods=['GET'])
def get_categories():
    divar_category=[(0,'buy-residential','فروش مسکونی','buy-apartment','آپارتمان'),(1,'buy-residential','فروش مسکونی','buy-villa','خانه و ویلا'),(2,'buy-residential','فروش مسکونی','buy-old-house','زمین و کلنگی'),(3,'rent-residential','اجاره مسکونی','rent-apartment','آپارتمان'),(4,'rent-residential','اجاره مسکونی','rent-villa','خانه و ویلا'),(5,'buy-commercial-property','فروش اداری و تجاری','buy-office','دفتر کار، اتاق اداری و مطب'),(6,'buy-commercial-property','فروش اداری و تجاری','buy-store','مغازه و غرفه'),(7,'buy-commercial-property','فروش اداری و تجاری','buy-industrial-agricultural-property','صنعتی،‌ کشاورزی و تجاری'),(8,'rent-commercial-property','اجاره اداری و تجاری','rent-office','دفتر کار، اتاق اداری و مطب'),(9,'rent-commercial-property','اجاره اداری و تجاری','rent-store','مغازه و غرفه'),(10,'rent-commercial-property','اجاره اداری و تجاری','rent-industrial-agricultural-property','صنعتی،‌ کشاورزی و تجاری'),(11,'rent-temporary','اجاره کوتاه مدت','rent-temporary-suite-apartment','آپارتمان و سوئیت'),(12,'rent-temporary','اجاره کوتاه مدت','rent-temporary-villa','ویلا و باغ'),(13,'rent-temporary','اجاره کوتاه مدت','rent-temporary-workspace','دفتر کار و فضای آموزشی')]
    return jsonify(divar_category)

@app.route('/get_cities/', methods=['GET'])
def get_cities():
    divar_city = [(1,'tehran','تهران'), (3,'karaj','کرج')]
    return jsonify( divar_city)

@app.route('/get_regiones/<int:city_id>', methods=['GET'])
def get_regiones(city_id):
    divar_region=[(636,1,'None','کریم آباد'),(1,2,'None','آزادشهر'),(2,2,'None','ابوطالب'),(3,2,'None','احمدآباد'),(4,2,'None','امام خمینی'),(5,2,'None','امام رضا'),(6,2,'None','امامت'),(7,2,'None','اندیشه'),(8,2,'None','بلوار الهیه'),(9,2,'None','بلوار ایرج میرزا'),(10,2,'None','بلوار توس'),(11,2,'None','بلوار فردوسی'),(12,2,'None','تربت حیدریه'),(13,2,'None','تورج'),(14,2,'None','جانباز'),(15,2,'None','حرم مطهر'),(16,2,'None','خیام'),(17,2,'None','دانش آموز'),(18,2,'None','دانشجو'),(19,2,'None','راهنمایی'),(20,2,'None','رسالت'),(21,2,'None','رضاشهر'),(22,2,'None','سجادشهر'),(23,2,'None','سرافرازان'),(24,2,'None','سعدی'),(25,2,'None','سناباد'),(26,2,'None','سید رضی'),(27,2,'None','شاندیز'),(28,2,'None','شهرک شهید رجایی'),(29,2,'None','شهید بهشتی'),(30,2,'None','صارمی'),(31,2,'None','صیاد شیرازی'),(32,2,'None','طبرسی'),(33,2,'None','طرق'),(34,2,'None','طرقبه'),(35,2,'None','طلاب'),(36,2,'None','عبادی'),(37,2,'None','عبدالمطلب'),(38,2,'None','فرامرز عباسی'),(39,2,'None','فلسطین'),(40,2,'None','فلکه برق'),(41,2,'None','فلکه ضد'),(42,2,'None','قائم'),(43,2,'None','قاسم آباد (شهرک غرب)'),(44,2,'None','قوچان'),(45,2,'None','لادن'),(46,2,'None','مصلی'),(47,2,'None','مطهری جنوبی'),(48,2,'None','مطهری شمالی'),(49,2,'None','معلم'),(50,2,'None','موسوی قوچانی'),(51,2,'None','میدان شهدا'),(52,2,'None','میدان عدل خمینی'),(53,2,'None','نوفل لو'),(54,2,'None','هاشمیه'),(55,2,'None','هدایت'),(56,2,'None','هفت تیر'),(57,2,'None','هنرستان'),(58,2,'None','وکیل آباد'),(59,2,'None','پیروزی'),(60,2,'None','چهارراه لشکر'),(61,2,'None','کاشمر'),(62,2,'None','کلاهدوز'),(63,2,'None','کوثر'),(64,2,'None','کوهسنگی'),(65,2,'None','کوی مهدی'),(66,2,'None','گاز شرقی'),(67,2,'None','گلبهار'),(68,2,'None','گنبدسبز'),(69,2,'None','گوهرشاد'),(70,2,'None','۱۷ شهریور'),(71,1,'None','اسکندری'),(72,1,'None','آجودانیه'),(73,1,'None','آذربایجان'),(74,1,'None','آذری'),(75,1,'None','آرارات'),(76,1,'None','آرژانتین'),(77,1,'None','آزاد شهر'),(78,1,'None','آهنگ'),(79,1,'None','ابراهیم‌آباد'),(80,1,'None','ابوذر'),(81,1,'None','احتشامیه'),(82,1,'None','اختیاریه'),(83,1,'None','ارامنه'),(84,1,'None','ارم'),(85,1,'None','ازگل'),(86,1,'None','استاد معین'),(87,1,'None','استخر'),(88,1,'None','اسفندیاری'),(89,1,'None','اسلام‌‌آباد'),(90,1,'None','افسریه'),(91,1,'None','اقدسیه'),(92,1,'None','المهدی'),(93,1,'None','الهیه'),(94,1,'None','امام حسین(ع)'),(95,1,'None','امامزاده قاسم'),(96,1,'None','امانیه'),(97,1,'None','امیر بهادر'),(98,1,'None','امیرآباد'),(99,1,'None','امیریه'),(100,1,'None','اندیشه'),(101,1,'None','اوقاف'),(102,1,'None','اوین'),(103,1,'None','اکباتان'),(104,1,'None','ایرانشهر'),(105,1,'None','بازار'),(106,1,'None','باغ آذری'),(107,1,'None','باغ رضوان'),(108,1,'None','باقرخان'),(109,1,'None','بریانک'),(110,1,'None','بلوار کشاورز'),(111,1,'None','بهاران'),(112,1,'None','بهارستان'),(113,1,'None','بهجت‌آباد'),(114,1,'None','بهمن‌ یار'),(115,1,'None','بوستان ولایت'),(116,1,'None','بومهن'),(117,1,'None','تجریش'),(118,1,'None','تهرانپارس شرقی'),(119,1,'None','تهرانپارس غربی'),(120,1,'None','تهران‌سر'),(121,1,'None','تهران‌نو'),(122,1,'None','تهران‌ویلا'),(123,1,'None','توحید'),(124,1,'None','جردن'),(125,1,'None','جماران'),(126,1,'None','جمال‌زاده'),(127,1,'None','جمشیدیه'),(128,1,'None','جمهوری'),(129,1,'None','جنت‌آباد جنوبی'),(130,1,'None','جنت‌آباد شمالی'),(131,1,'None','جنت‌‌آباد مرکزی'),(132,1,'None','جوادیه'),(133,1,'None','جوانمرد قصاب'),(134,1,'None','جی'),(135,1,'None','جیحون'),(136,1,'None','حسن‌آباد'),(137,1,'None','حسن‌آباد باقرفر'),(138,1,'None','حسن‌آباد شمالی'),(139,1,'None','حشمتیه'),(140,1,'None','حکیمیه'),(141,1,'None','خانی‌آباد'),(142,1,'None','خزانه'),(143,1,'None','خلیج فارس'),(144,1,'None','خورین'),(145,1,'None','دارآباد'),(146,1,'None','دانشگاه تهران'),(147,1,'None','دبستان'),(148,1,'None','دربند'),(149,1,'None','دردشت'),(150,1,'None','دروازه شمیران'),(151,1,'None','دروس'),(152,1,'None','درکه'),(153,1,'None','دریان‌نو‍'),(154,1,'None','دزاشیب'),(155,1,'None','دهکده المپیک'),(156,1,'None','ده‌ونک'),(157,1,'None','دولاب'),(158,1,'None','دولت‌آباد'),(159,1,'None','دیلمان'),(160,1,'None','دیلمان جنوبی'),(161,1,'None','رباط کریم'),(162,1,'None','رودهن'),(163,1,'None','زرگنده'),(164,1,'None','زعفرانیه'),(165,1,'None','زهتابی'),(166,1,'None','زینبیه'),(167,1,'None','سازمان آب'),(168,1,'None','سازمان برنامه'),(169,1,'None','ستارخان'),(170,1,'None','سرسبز'),(171,1,'None','سرو آزاد'),(172,1,'None','سعادت‌آباد'),(173,1,'None','سعدآباد'),(174,1,'None','سلسبیل'),(175,1,'None','سلیمانیه'),(176,1,'None','سنگلج'),(177,1,'None','سهروردی'),(178,1,'None','سهروردی جنوبی'),(179,1,'None','سهروردی شمالی'),(180,1,'None','سوهانک'),(181,1,'None','سید خندان'),(182,1,'None','سیدخندان'),(183,1,'None','شادآباد'),(184,1,'None','شادمان'),(185,1,'None','شاهین'),(186,1,'None','شاپور'),(187,1,'None','شریف‌آباد'),(188,1,'None','شمس‌آباد'),(189,1,'None','شمیران‌نو'),(190,1,'None','شهر ری'),(191,1,'None','شهر ری - هاشم‌آباد'),(192,1,'None','شهر زیبا'),(193,1,'None','شهر قدس'),(194,1,'None','شهرآرا'),(195,1,'None','شهران جنوبی'),(196,1,'None','شهران شمالی'),(197,1,'None','شهرک آزادی'),(198,1,'None','شهرک آسمان'),(199,1,'None','شهرک آپادانا'),(200,1,'None','شهرک ابوذر'),(201,1,'None','شهرک ارغوان'),(202,1,'None','شهرک استقلال'),(203,1,'None','شهرک امام خمینی'),(204,1,'None','شهرک امید'),(205,1,'None','شهرک انصار'),(206,1,'None','شهرک بخارایی'),(207,1,'None','شهرک بعثت'),(208,1,'None','شهرک تختی'),(209,1,'None','شهرک دانشگاه'),(210,1,'None','شهرک دریا'),(211,1,'None','شهرک رضوان'),(212,1,'None','شهرک رضویه'),(213,1,'None','شهرک شاهین'),(214,1,'None','شهرک شریعتی'),(215,1,'None','شهرک شریفی'),(216,1,'None','شهرک شهربانی'),(217,1,'None','شهرک شهرداری'),(218,1,'None','شهرک شهید مفتح'),(219,1,'None','شهرک طالقانی'),(220,1,'None','شهرک عباسپور'),(221,1,'None','شهرک عباسی'),(222,1,'None','شهرک غرب'),(223,1,'None','شهرک غزالی'),(224,1,'None','شهرک فاطمه الزهرا'),(225,1,'None','شهرک فردوس'),(226,1,'None','شهرک فرهنگیان'),(227,1,'None','شهرک فرهنگیان غرب'),(228,1,'None','شهرک قدس'),(229,1,'None','شهرک محلاتی'),(230,1,'None','شهرک مسلمین'),(231,1,'None','شهرک نفت'),(232,1,'None','شهرک هجرت'),(233,1,'None','شهرک والفجر'),(234,1,'None','شهرک ولیعصر'),(235,1,'None','شهرک ویلاشهر'),(236,1,'None','شهرک پارس'),(237,1,'None','شهرک پاسداران'),(238,1,'None','شهرک پرواز'),(239,1,'None','شهرک چشمه'),(240,1,'None','شهرک ژاندارمری'),(241,1,'None','شهرک کاظمیه'),(242,1,'None','شهرک کمالی'),(243,1,'None','شهرک کوهسار'),(244,1,'None','شهرک کیانشهر'),(245,1,'None','شهرک گلستان'),(246,1,'None','شهرک گلستان غربی'),(247,1,'None','شهرک گلها'),(248,1,'None','شهریار'),(249,1,'None','شوش'),(250,1,'None','شکوفه'),(251,1,'None','شیان'),(252,1,'None','شیخ الرئیس'),(253,1,'None','شیخ هادی'),(254,1,'None','شیرازی'),(255,1,'None','صادقیه'),(256,1,'None','صد دستگاه'),(257,1,'None','ضرابخانه'),(258,1,'None','طالقانی'),(259,1,'None','طرشت'),(260,1,'None','ظفر'),(261,1,'None','ظهیرآباد'),(262,1,'None','عباس‌آباد'),(263,1,'None','عبدل‌آباد'),(264,1,'None','عشرت‌آباد'),(265,1,'None','علم و صنعت'),(266,1,'None','علی‌آباد'),(267,1,'None','علی‌آباد جنوبی'),(268,1,'None','علی‌آباد شمالی'),(269,1,'None','فاطمی'),(270,1,'None','فدک'),(271,1,'None','فرحزاد'),(272,1,'None','فرح‌آباد'),(273,1,'None','فرمانیه'),(274,1,'None','فرودگاه مهر‌آباد'),(275,1,'None','فشم'),(276,1,'None','فلاح'),(277,1,'None','فیروزکوه'),(278,1,'None','قرچک'),(279,1,'None','قزل قلعه'),(280,1,'None','قصر'),(281,1,'None','قصر فیروزه ۱'),(282,1,'None','قصر فیروزه ۲'),(283,1,'None','قلعه فتح‌آباد'),(284,1,'None','قلهک'),(285,1,'None','قنات‌کوثر'),(286,1,'None','قیامدشت'),(287,1,'None','قیطریه'),(288,1,'None','لواسان'),(289,1,'None','لویزان'),(290,1,'None','مبارک‌آباد'),(291,1,'None','مبارک‌آباد بهشتی'),(292,1,'None','مجموعه ورزشگاه آزادی'),(293,1,'None','مجیدآباد'),(294,1,'None','مجیدیه'),(295,1,'None','مجید‌آباد'),(296,1,'None','محمودیه'),(297,1,'None','مرادآباد'),(298,1,'None','مرزداران'),(299,1,'None','مسعودیه'),(300,1,'None','مشیریه'),(301,1,'None','مطهری'),(302,1,'None','ملک‌آباد'),(303,1,'None','منصوریه'),(304,1,'None','منظریه'),(305,1,'None','منیریه'),(306,1,'None','مهرآباد جنوبی'),(307,1,'None','مهران'),(308,1,'None','مولوی'),(309,1,'None','میدان آزادی'),(310,1,'None','میدان انقلاب'),(311,1,'None','میدان حر'),(312,1,'None','میدان ولیعصر'),(313,1,'None','میرداماد'),(314,1,'None','نارمک'),(315,1,'None','نازی‌آباد'),(316,1,'None','نظام‌آباد'),(317,1,'None','نعمت‌آباد'),(318,1,'None','نواب'),(319,1,'None','نیاوران'),(320,1,'None','نیرو هوایی'),(321,1,'None','هاشم‌آباد'),(322,1,'None','هفت‌ حوض'),(323,1,'None','وحیدیه'),(324,1,'None','ورامین'),(325,1,'None','وردآورد'),(326,1,'None','وصفنارد'),(327,1,'None','ولنجک'),(328,1,'None','ونک'),(329,1,'None','ياخچی‌آباد'),(330,1,'None','يافت‌آباد'),(331,1,'None','پارک آزادگان'),(332,1,'None','پارک شهر'),(333,1,'None','پارک لاله'),(334,1,'None','پاسداران'),(335,1,'None','پامنار'),(336,1,'None','پاکدشت'),(337,1,'None','پردیس'),(338,1,'None','پردیسان'),(339,1,'None','پرند'),(340,1,'None','پل رومی'),(341,1,'None','پونک'),(342,1,'None','پیروزی'),(343,1,'None','پیکان شهر'),(344,1,'None','چهارصد دستگاه'),(345,1,'None','چیتگر'),(346,1,'None','چیتگر شمالی'),(347,1,'None','چیذر'),(348,1,'None','کاروان'),(349,1,'None','کاشانک'),(350,1,'None','کاظم‌آباد'),(351,1,'None','کالاد'),(352,1,'None','کامرانیه'),(353,1,'None','کتابخانه ملی ایران'),(354,1,'None','کن'),(355,1,'None','کوهک'),(356,1,'None','کوی اسلام'),(357,1,'None','کوی بیمه'),(358,1,'None','کوی دانشگاه'),(359,1,'None','کوی فردوس'),(360,1,'None','کوی مهرآباد'),(361,1,'None','کوی هفدهم شهریور'),(362,1,'None','گاندی'),(363,1,'None','گلاب دره'),(364,1,'None','گمرک'),(365,1,'None','گیشا (کوی نصر)'),(366,1,'None','یوسف‌آباد'),(367,3,'None','آزادگان'),(368,3,'None','باغستان'),(369,3,'None','جهانشهر'),(370,3,'None','حصارک'),(371,3,'None','خرمدشت'),(372,3,'None','درختی'),(373,3,'None','دهقان ویلا'),(374,3,'None','ساسانی'),(375,3,'None','شاهین ویلا'),(376,3,'None','شهر جدید اندیشه'),(377,3,'None','شهر جدید هشتگرد'),(378,3,'None','شهرک اوج'),(379,3,'None','شهرک بنفشه'),(380,3,'None','شهرک وحدت'),(381,3,'None','شهریار'),(382,3,'None','طالقانی'),(383,3,'None','عظیمیه'),(384,3,'None','فردیس'),(385,3,'None','مارلیک'),(386,3,'None','ماهدشت'),(387,3,'None','محمد شهر'),(388,3,'None','مشکین دشت'),(389,3,'None','مصباح'),(390,3,'None','ملارد'),(391,3,'None','منظریه'),(392,3,'None','مهرشهر'),(393,3,'None','مهرویلا'),(394,3,'None','میدان نبوت'),(395,3,'None','هشتگرد'),(396,3,'None','هفت تیر'),(397,3,'None','کمالشهر'),(398,3,'None','کیانمهر'),(399,3,'None','گلشهر'),(400,3,'None','گوهردشت'),(401,4,'None','آذر'),(402,4,'None','آزادگان'),(403,4,'None','امام'),(404,4,'None','امامزاده ابراهیم'),(405,4,'None','انسجام'),(406,4,'None','انصار‌الحسین'),(407,4,'None','انقلاب (چهارمردان)'),(408,4,'None','باجک (۱۹ دی)'),(409,4,'None','بلوار امین'),(410,4,'None','بلوار کاشانی'),(411,4,'None','بلوار ۱۵ خرداد'),(412,4,'None','بنیاد'),(413,4,'None','توحید'),(414,4,'None','جمهوری'),(415,4,'None','حرم'),(416,4,'None','دانیال'),(417,4,'None','دورشهر'),(418,4,'None','زنبیل‌آباد (شهید صدوقی)'),(419,4,'None','سالاریه'),(420,4,'None','سمیه'),(421,4,'None','شهرک قدس'),(422,4,'None','شهید بهشتی'),(423,4,'None','صفائیه'),(424,4,'None','صفاشهر'),(425,4,'None','عطاران'),(426,4,'None','عمار یاسر'),(427,4,'None','مدرس'),(428,4,'None','هفت تیر'),(429,4,'None','هنرستان'),(430,4,'None','پردیسان'),(431,4,'None','پلیس'),(432,4,'None','پیام نور'),(433,4,'None','کلهری'),(434,4,'None','کیوانفر'),(435,4,'None','گلزار'),(436,4,'None','یزدان‌شهر'),(437,3,'None','آزادگان'),(438,3,'None','باغستان'),(439,3,'None','جهانشهر'),(440,3,'None','حصارک'),(441,3,'None','خرمدشت'),(442,3,'None','درختی'),(443,3,'None','دهقان ویلا'),(444,3,'None','ساسانی'),(445,3,'None','شاهین ویلا'),(446,3,'None','شهر جدید اندیشه'),(447,3,'None','شهر جدید هشتگرد'),(448,3,'None','شهرک اوج'),(449,3,'None','شهرک بنفشه'),(450,3,'None','شهرک وحدت'),(451,3,'None','شهریار'),(452,3,'None','طالقانی'),(453,3,'None','عظیمیه'),(454,3,'None','فردیس'),(455,3,'None','مارلیک'),(456,3,'None','ماهدشت'),(457,3,'None','محمد شهر'),(458,3,'None','مشکین دشت'),(459,3,'None','مصباح'),(460,3,'None','ملارد'),(461,3,'None','منظریه'),(462,3,'None','مهرشهر'),(463,3,'None','مهرویلا'),(464,3,'None','میدان نبوت'),(465,3,'None','هشتگرد'),(466,3,'None','هفت تیر'),(467,3,'None','کمالشهر'),(468,3,'None','کیانمهر'),(469,3,'None','گلشهر'),(470,3,'None','گوهردشت'),(471,5,'None',''),(472,5,'None',' آتشگاه'),(473,5,'None',' ابن سینا'),(474,5,'None',' بزرگمهر'),(475,5,'None',' بهارستان'),(476,5,'None',' بید آباد'),(477,5,'None',' تیران'),(478,5,'None',' جلفا'),(479,5,'None',' حسین‌آباد'),(480,5,'None',' حکیم نظامی'),(481,5,'None',' خاقانی'),(482,5,'None',' خانه'),(483,5,'None',' خمینی شهر'),(484,5,'None',' خیام'),(485,5,'None',' دروازه تهران (میدان جمهوری)'),(486,5,'None',' دروازه شیراز (میدان آزادی)'),(487,5,'None',' دولت آباد'),(488,5,'None',' رباط'),(489,5,'None',' زرین‌شهر'),(490,5,'None',' زینبیه'),(491,5,'None',' سروش'),(492,5,'None',' سه راه سیمین'),(493,5,'None',' سپاهان شهر'),(494,5,'None',' سیچان'),(495,5,'None',' شاهین شهر'),(496,5,'None',' شهرضا'),(497,5,'None',' شیخ بهایی'),(498,5,'None',' شیخ صدوق جنوبی'),(499,5,'None',' شیخ صدوق شمالی'),(500,5,'None',' عباس آباد'),(501,5,'None',' فولادشهر'),(502,5,'None',' لنبان'),(503,5,'None',' مبارکه'),(504,5,'None',' مرداویچ'),(505,5,'None',' مشتاق اول'),(506,5,'None',' مشتاق دوم'),(507,5,'None',' مشتاق سوم'),(508,5,'None',' ملک شهر'),(509,5,'None',' مولوی'),(510,5,'None',' میر'),(511,5,'None',' نشاط'),(512,5,'None',' هاتف'),(513,5,'None',' هشت بهشت'),(514,5,'None',' پروین'),(515,5,'None',' پل شیری (صائب)'),(516,5,'None',' پل وحید'),(517,5,'None',' چهارباغ خواجو'),(518,5,'None',' گز'),(519,6,'None','آریاشهر'),(520,6,'None','امانیه'),(521,6,'None','باهنر'),(522,6,'None','بهارستان'),(523,6,'None','حصیرآباد'),(524,6,'None','رسالت'),(525,6,'None','زرگان'),(526,6,'None','زیباشهر'),(527,6,'None','زیتون کارمندی'),(528,6,'None','زیتون کارگری'),(529,6,'None','سپیدار'),(530,6,'None','سیصد دستگاه'),(531,6,'None','شریعتی جنوبی'),(532,6,'None','شهرک آغاجری'),(533,6,'None','شهرک حفاری'),(534,6,'None','شهرک دانشگاه'),(535,6,'None','شهرک نفت'),(536,6,'None','صد دستگاه'),(537,6,'None','طالقانی'),(538,6,'None','فاز دو پاداد'),(539,6,'None','فاز یک پادادشهر'),(540,6,'None','فرهنگ شهر'),(541,6,'None','فولادشهر'),(542,6,'None','لشکرآباد'),(543,6,'None','معین زاده'),(544,6,'None','ملی راه'),(545,6,'None','نادری'),(546,6,'None','نیوسایت'),(547,6,'None','پادادشهر'),(548,6,'None','پردیس'),(549,6,'None','پیروزی'),(550,6,'None','کانتکس'),(551,6,'None','کمپلو جنوبی (کوی انقلاب)'),(552,6,'None','کمپلوی شمالی (لشکر)'),(553,6,'None','کوت عبدالله'),(554,6,'None','کوروش (کوی ملت)'),(555,6,'None','کوی رمضان'),(556,6,'None','کوی سلطان منش'),(557,6,'None','کوی فرهنگیان'),(558,6,'None','کوی مدرس'),(559,6,'None','کوی مهدیس'),(560,6,'None','کوی نبوت'),(561,6,'None','کوی نفت'),(562,6,'None','کیان آباد'),(563,6,'None','کیانشهر'),(564,6,'None','کیانپارس'),(565,6,'None','گلستان'),(566,6,'None','یوسفی'),(567,7,'None','کرمانشاه'),(568,8,'None','تبریز'),(569,9,'None','ادبیات'),(570,9,'None','ارتش'),(571,9,'None','ارم'),(572,9,'None','اطلسی'),(573,9,'None','امیرکبیر'),(574,9,'None','باهنر جنوبی'),(575,9,'None','باهنر شمالی'),(576,9,'None','بعثت'),(577,9,'None','بلوار رحمت'),(578,9,'None','بلوار عدالت'),(579,9,'None','بلوار فضیلت'),(580,9,'None','بلوار مدرس'),(581,9,'None','بنی هاشمی'),(582,9,'None','تاچارا'),(583,9,'None','جمهوری'),(584,9,'None','خلدبرین'),(585,9,'None','دلگشا'),(586,9,'None','زرگری'),(587,9,'None','زند'),(588,9,'None','زیباشهر'),(589,9,'None','ستاد'),(590,9,'None','ستارخان'),(591,9,'None','سراج'),(592,9,'None','سرداران'),(593,9,'None','سفیر جنوبی'),(594,9,'None','سفیر شمالی'),(595,9,'None','سیاحتگر'),(596,9,'None','سینما سعدی'),(597,9,'None','شهرک بهشتی'),(598,9,'None','شهرک رکن آباد'),(599,9,'None','شهرک مطهری'),(600,9,'None','شهرک پرواز'),(601,9,'None','شهرک گلستان'),(602,9,'None','صدرا فاز دو'),(603,9,'None','صدرا فاز یک'),(604,9,'None','صنایع (میرزای شیرازی)'),(605,9,'None','عفیف آباد'),(606,9,'None','فخرآباد'),(607,9,'None','فرصت شیرازی'),(608,9,'None','فرهنگ شهر'),(609,9,'None','فرگاز'),(610,9,'None','فسا'),(611,9,'None','فلکه گاز (آزادی)'),(612,9,'None','قدوسی شرقی'),(613,9,'None','قدوسی غربی'),(614,9,'None','قصردشت'),(615,9,'None','مرودشت'),(616,9,'None','مطهری'),(617,9,'None','معالی آباد'),(618,9,'None','ملاصدرا'),(619,9,'None','میانرود'),(620,9,'None','میدان معلم'),(621,9,'None','نصر'),(622,9,'None','همت جنوبی (ایمان)'),(623,9,'None','همت شمالی (ایمان)'),(624,9,'None','والفجر'),(625,9,'None','پارامونت'),(626,9,'None','پاسارگاد'),(627,9,'None','پاسداران'),(628,9,'None','پایگاه هوایی'),(629,9,'None','پل غدیر'),(630,9,'None','چمران'),(631,9,'None','کازرون'),(632,9,'None','کلبه'),(633,9,'None','کوی زهرا'),(634,9,'None','گلدشت حافظ'),(635,10,'None','')]
    regions_city=[region for region in divar_region if region[1]==city_id]
    return jsonify(regions_city)

@app.route('/get_advertisers_type/', methods=['GET'])
def get_advertisers_type():
    divar_advertiser_type =[(0,'personal','شخصی'),(1,'agency','مشاور املاک')]
    return jsonify(divar_advertiser_type)

@app.route('/get_advertisemnts_type/', methods=['GET'])
def get_advertisemnts_type():
    divar_advertisemnt_type = [(0, 'provide', 'ارائه'), (1, 'request', 'درخواستی'),(2,'offer','فروشی')]
    return jsonify(divar_advertisemnt_type)

@app.route('/add_query/', methods=['POST'])
def add_query():
    if request.headers['Content-Type'] == 'application/json' and request.method == 'POST':
        input_query = request.json

        total_fields=query_template.keys()
        sorted(total_fields)
        sql_query=[]
        for field in total_fields:
            if field not in input_query:
                continue
            if field in ['elevator','agreed','parking','exchange', 'urgent']:
                sql_query.append('({})'.format('{}={}'.format(field,input_query[field])))
            elif field in ['advertisement_type', 'advertiser_type', 'category','region']:
                temp=['{}_id={}'.format(field, value) for value in input_query[field]]
                sql_query.append('({})'.format(' or '.join(temp)))
            elif field in ['floor', 'rooms']:
                temp=['{}={}'.format(field, value) for value in input_query[field]]
                sql_query.append('({})'.format(' or '.join(temp)))
            else:
                value=input_query[field].strip()
                if value[0]=='-':
                    max_value=value[1:]
                    sql_query.append('({}<={})'.format(field,max_value))
                elif value[-1]=='-':
                    min_value = value[:-1]
                    sql_query.append('({}>={})'.format(field, min_value))
                else:
                    min_value,max_value=value.split('-')
                    sql_query.append('({}>={} and {}<={})'.format(field, min_value,field,max_value))

        query_id=0
        if len(sql_query)>0:
            query_id=mysql_helper.add_query( json.dumps(input_query),' and '.join(sql_query))
        output={'query_id':query_id}
        return jsonify(output)



@app.route('/get_queries/', methods=['GET'])
def get_queries():
    queries=[]
    for query in mysql_helper.get_queries():
        query_id=query['query_id']
        input_query=json.loads(query['input_query'])
        input_query['id']=query_id
        queries.append(input_query)

    output={'queries':queries}
    return jsonify(output)

@app.route('/del_query/<int:query_id>', methods=['GET'])
def del_query(query_id):
    result=mysql_helper.del_query(query_id)
    output={'deleted':result}
    return jsonify(output)

@app.route('/get_items/<int:query_id>/<int:last_timestamp>', methods=['GET'])
def get_items(query_id,last_timestamp):
    items=mysql_helper.get_items(query_id,last_timestamp)
    for item in items:
        for field in list(item.keys()):
            if field not in item:
                continue
            value=item[field]
            if field in ['rooms','floor','size','year','phone']:
                value=digits.en_to_fa(str(value))
                item[field]=value
            elif field in ['images']:
                item[field]=['https://s101.divarcdn.com/static/pictures/'+img for img in value.split(',')]
            elif field in ['price','rent','deposite']:
                value = f"{value:,}"
                value = digits.en_to_fa(str(value))
                item[field]=value

            elif field in ['created_time']:
                published_time=item['published_date']
                time_now=datetime.now()
                diff_hours=(time_now-published_time).total_seconds()/3600
                if diff_hours > 2:
                    if time_now.day==published_time.day:
                            item['published_date']=' ساعت قبل{}'.format( digits.en_to_fa(diff_hours))
                    if item['urgent'] == 'بله':
                        item['published_date'] = "فوری " + item['published_date']
                else:
                    item['published_date'] = 'دیشب'

                del item['created_time']
                del item['published_date']
    if len(items)>0:
        output={'items':items,'last_timestamp':items[-1]['created_time']}
    else:
        output = {'items': [], 'last_timestamp': 0}
    return jsonify(output)

@app.route('/')
def index():
    return "<h1>Welcome to our server !!</h1>"


if __name__ == "__main__":
    app.run(port=2021)